{
  "_name_or_path": "microsoft/cvt-13",
  "architectures": [
    "CvtForImageClassification"
  ],
  "attention_drop_rate": [
    0.0,
    0.0,
    0.0
  ],
  "cls_token": [
    false,
    false,
    true
  ],
  "depth": [
    1,
    2,
    10
  ],
  "drop_path_rate": [
    0.0,
    0.0,
    0.1
  ],
  "drop_rate": [
    0.0,
    0.0,
    0.0
  ],
  "embed_dim": [
    64,
    192,
    384
  ],
  "id2label": {
    "0": "1",
    "1": "2",
    "2": "3",
    "3": "4",
    "4": "5",
    "5": "6",
    "6": "7",
    "7": "8",
    "8": "9",
    "9": "A",
    "10": "B",
    "11": "C",
    "12": "D",
    "13": "E",
    "14": "F",
    "15": "G",
    "16": "H",
    "17": "I",
    "18": "J",
    "19": "K",
    "20": "L",
    "21": "M",
    "22": "N",
    "23": "O",
    "24": "P",
    "25": "Q",
    "26": "R",
    "27": "S",
    "28": "T",
    "29": "U",
    "30": "V",
    "31": "W",
    "32": "X",
    "33": "Y",
    "34": "Z",
    "35": "about",
    "36": "above",
    "37": "absent",
    "38": "accept",
    "39": "afraid",
    "40": "agree",
    "41": "always",
    "42": "around",
    "43": "assistance",
    "44": "bad",
    "45": "child",
    "46": "college",
    "47": "doctor",
    "48": "father",
    "49": "from",
    "50": "ghost",
    "51": "group",
    "52": "mother",
    "53": "old",
    "54": "pray",
    "55": "present",
    "56": "secondary",
    "57": "skin",
    "58": "small",
    "59": "specific",
    "60": "spouse",
    "61": "stand",
    "62": "teach",
    "63": "there",
    "64": "through",
    "65": "today",
    "66": "toward",
    "67": "up",
    "68": "warn",
    "69": "wear",
    "70": "welcome",
    "71": "which",
    "72": "wish",
    "73": "with",
    "74": "without",
    "75": "work",
    "76": "you"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "kernel_qkv": [
    3,
    3,
    3
  ],
  "label2id": {
    "1": 0,
    "2": 1,
    "3": 2,
    "4": 3,
    "5": 4,
    "6": 5,
    "7": 6,
    "8": 7,
    "9": 8,
    "A": 9,
    "B": 10,
    "C": 11,
    "D": 12,
    "E": 13,
    "F": 14,
    "G": 15,
    "H": 16,
    "I": 17,
    "J": 18,
    "K": 19,
    "L": 20,
    "M": 21,
    "N": 22,
    "O": 23,
    "P": 24,
    "Q": 25,
    "R": 26,
    "S": 27,
    "T": 28,
    "U": 29,
    "V": 30,
    "W": 31,
    "X": 32,
    "Y": 33,
    "Z": 34,
    "about": 35,
    "above": 36,
    "absent": 37,
    "accept": 38,
    "afraid": 39,
    "agree": 40,
    "always": 41,
    "around": 42,
    "assistance": 43,
    "bad": 44,
    "child": 45,
    "college": 46,
    "doctor": 47,
    "father": 48,
    "from": 49,
    "ghost": 50,
    "group": 51,
    "mother": 52,
    "old": 53,
    "pray": 54,
    "present": 55,
    "secondary": 56,
    "skin": 57,
    "small": 58,
    "specific": 59,
    "spouse": 60,
    "stand": 61,
    "teach": 62,
    "there": 63,
    "through": 64,
    "today": 65,
    "toward": 66,
    "up": 67,
    "warn": 68,
    "wear": 69,
    "welcome": 70,
    "which": 71,
    "wish": 72,
    "with": 73,
    "without": 74,
    "work": 75,
    "you": 76
  },
  "layer_norm_eps": 1e-12,
  "mlp_ratio": [
    4.0,
    4.0,
    4.0
  ],
  "model_type": "cvt",
  "num_channels": 3,
  "num_heads": [
    1,
    3,
    6
  ],
  "num_stages": 3,
  "padding_kv": [
    1,
    1,
    1
  ],
  "padding_q": [
    1,
    1,
    1
  ],
  "patch_padding": [
    2,
    1,
    1
  ],
  "patch_sizes": [
    7,
    3,
    3
  ],
  "patch_stride": [
    4,
    2,
    2
  ],
  "pos_embed": [
    false,
    false,
    false
  ],
  "qkv_bias": [
    true,
    true,
    true
  ],
  "qkv_projection_method": [
    "dw_bn",
    "dw_bn",
    "dw_bn"
  ],
  "stride_kv": [
    2,
    2,
    2
  ],
  "stride_q": [
    1,
    1,
    1
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.46.3"
}
